package main

import (
	"fmt"
)

type ListNode struct {
	Val int
	Next *ListNode
}

/*
	---------------
	l1 2 4 3
	l2 5 6 4 6
	++++++++++++++++
	ทด     1   
	l1 2 4 3 0 nil
	   v v v v v
	l2 5 6 4 6 nil
	=> 7 0 8 6 
	
*/

func addTwoNumbers(l1 *ListNode, l2 *ListNode) *ListNode {
	//--------------- ส่วนการบวกเลข --------------------
    sumVal := l1.Val + l2.Val
	// กรณีบวกกันค่าเกิน 10 ให้ทด 1
	if (sumVal >= 10) {
		// นำตัวเลขหลักหน่วย มาเก็บไว้ที่ l1
		l1.Val = sumVal - 10
		// ถ้าตัวถัดไปของ l1 ไม่มีเเล้ว
		if (l1.Next == nil) {
			// ที่ใส่ 1 เพราะถ้าว่างก็เหมือนกับมีค่าเป็น 0 เเละพอทด 1 ไป ก็เท่ากับ 0 + 1 => 1
			l1.Next = &ListNode{Val: 1, Next: nil}
		} else {
			// นำผลทดไปบวกกับเลขตัวถัดไป ซึ่งเลขหลักหน่วยกับกัน2ตัว มากสุดเเค่ 18 ตัวเลขหลักสิบ จึงเป็นได้เเค่ 1
			l1.Next.Val += 1
		}
	} else {
		// กรณีบวกกันค่าไม่เกิน 10 ให้นำค่าที่บวกกันได้ มาเก็บไว้ที่ l1
		l1.Val = sumVal
	}

	// ------------------ ส่วนที่จัดการว่าจะให้บวกต่อหรือพอเเค่นี้ -----------------------
	// เมื่อค่าทั้ง 2 ไม่มีตัวถนัดไปเเล้วให้จบการบวกเลข เพื่อย้อนกลับฟังก์ชั่น
	if (l1.Next == nil && l2.Next == nil) {
		/*
			📢 ในเมื่อไปต่อก็ไม่มีค่าแล้ว ก็คงต้องพอเเค่นี้น่ะ
			📢 ไม่ใช่เพราะว่าถึงจะไปต่อก็ไม่มีค่าน่ะ แต่กลัวไปต่อเเล้วก็โปรแกรมจะรันไม่มีไม่วันจบอ่ะ😂😂😂
		*/
		return &ListNode{Val: sumVal}
	} else if (l1.Next == nil) {
		// ต้องการบวกต่อ เเต่ l1 ไม่มีตัวถนัดไปเเล้ว
		l1.Next = addTwoNumbers(&ListNode{Val: 0}, l2.Next)
	} else if (l2.Next == nil) {
		// ต้องการบวกต่อ เเต่ l2 ไม่มีตัวถนัดไปเเล้ว
		l1.Next = addTwoNumbers(l1.Next, &ListNode{Val: 0})
	} else {
		// ต้องการบวกต่อเเละทั้งค่า ยังมีตัวถัดไป เขียน .next เพราะต้องการส่งตัวถัดไปบวกต่อ
		l1.Next = addTwoNumbers(l1.Next, l2.Next)
	}
	return l1
}


func printList(head *ListNode) {
    for head != nil {
        fmt.Print(head.Val, " ")
        head = head.Next
    }
}

func main() {
	l1 := &ListNode{
		Val: 2,
		Next: &ListNode{
			Val: 4,
			Next: &ListNode{
				Val: 3,
				
			},
		},
	}

	l2 := &ListNode{
		Val: 5,
		Next: &ListNode{
			Val: 6,
			Next: &ListNode{
				Val: 4,
				Next: &ListNode{
					Val: 6,
				},
			},
		},
	}
	l1 = addTwoNumbers(l1, l2)
	printList(l1)
}